constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          1000;
        startFace       27900;
    }
    outlet
    {
        type            patch;
        nFaces          1000;
        startFace       28900;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2200;
        startFace       29900;
    }
)

// ************************************************************************* //
